app/views/users/rooms.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
        </thead>
        <% @user.posts.each do |post| %>