app/views/reservations/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ?  [["id", 27]]
---
        <% @reservations.each do |reservation| %>
            <% @posts = Post.where(id: reservation.post_id) %>