app/controllers/posts_controller.rb

  def create
    @post = Post.new(
      r_name: params[:r_name],
      r_introduction: params[:r_introduction],
      r_price: params[:r_price],
      r_adress: params[:r_adress],
      r_image: params[:r_image],
      user_id: @current_user.id)
    if @post.save
---
INSERT INTO "posts" ("r_name", "r_introduction", "r_price", "r_adress", "r_image", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def search
    @posts = Post.search(params[:search],params[:free])
---
SELECT "posts".* FROM "posts" WHERE (r_introduction LIKE '%広いお部屋%' OR r_name LIKE '%広いお部屋%')

  def show
    @post = Post.find_by(id: params[:id])
    @user = User.find_by(id: @post.user_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]