app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.where(user_id: @current_user.id)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 3]]

  def new
    @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]

  def create
    @post = Post.find_by(id: params[:id])
    @reservation = Reservation.new(
      start_date: params[:start_date],
      end_date: params[:end_date],
      people: params[:people],
      user_id: @current_user.id,
      post_id: params[:post_id],
      total_price: params[:total_price],
      p1_price: params[:p1_price]
    )
    if @reservation.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "reservations" ("start_date", "end_date", "people", "user_id", "post_id", "created_at", "updated_at", "total_price", "p1_price") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)