app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
      image:'default_user.jpg')
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def account
    @user = User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @user = User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def profile
    @user = User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "豚じゃないよ！！\r\nかほだよ！！"], ["updated_at", "2021-03-20 11:43:48.307169"], ["id", 3]]
---
  def compilation
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.introduction = params[:introduction]
    if params[:image]
    @user.image = "#{@user.id}.jpg"
    image = params[:image]
    File.binwrite("public/user_images/#{params[:id]}.jpg",image.read)
    end
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def rooms
    @user = User.find_by(id: params[:id])